{"reviews": [{"id": "R320HT3E83VQNV", "type": "neg", "site": "amazon", "title": "Overall improvement, but lost its flexibility", "stars": "3.0 out of 5 stars", "date": "Reviewed in the United States on October 15, 2018", "text": "I have 5 Echo Dots (gen 2) and we use them throughout the house for just about everything, being we have a fairly smart home. What I liked about the gen 2 versions, were that they were compact and very flexible on how you could use them. They were easy to mount in different positions and being that they used a fairly standard USB interface for the power, you could really be flexible on how and where you mounted them. The one thing that they really missed on? The well known sound quality.\n\nEnter the Gen 3...\nI really like the improvement in sound. Sure it is not a high quality speaker system, but for the size it is pretty good. Especially when you consider that you can pair them and add a sub for pretty good sound. The look is improved over the gen 2, however it does lose a little bit of the customability that the gen 2 had. With the gen 2, you could purchase different wraps, stands, clock mounts, wall mounts, etc. You could really customize it. The gen 3 is a bit bigger and has a much more rounded shape. While it makes it look better by itself, it lacks the ability to really customize it. It surely would not work as a power socket mount, like you could do with the gen 2, just due to the additional weight.\n\nThat is before you get to the horrendous power cord and adapter. The power adapter is twice as big as the gen 2 and the power cord went away from the, easy to find, usb style cord to a old style input style and it is permanently attached to the power adapter. This is really my biggest complaint as it took away so much flexibility, that you could enjoy with the gen 2. Don't get me wrong, I am sure there will be several new cords and adapters put out to fill the gap, but that is not as easy as using cords many already have. Just makes no sense. Not to mention the cord is really long, so in areas where you want it to be a bit more discreet, this thing sticks out like a sore thumb.\n\nWhat I like...\nSound Quality is a step up\nSound Volume is much improved\nBase look is much improved\n\nWhat I dislike...\nMuch less flexibility on how it is used versus previous version\nNon-standard power cord\nBulky adapter\nUgly long cord", "source": "amazon"}, {"id": "R2ZMOX4MNNWD3M", "type": "neg", "site": "amazon", "title": "Muffled", "stars": "1.0 out of 5 stars", "date": "Reviewed in the United States on October 18, 2018", "text": "I bought this to replace my old Echo Dot gen 2. I am very disappointed. Alexa sounds distant and muffled. Music playback and the alarms sound normal. There is something wrong when she speaks and I have to turn the echo dot up. Only problem is, when the alarm goes off in the mornings it’s super loud. Wish they would add new volume settings is this is going to be the norm going forward. Also, very disappointed in Amazon customer service. I was supposed to have a call back yesterday morning between 8:30am-9:3am CST and it never happened. I will be requesting a replacement device and I’m leaving this bad review in part because of the failed customer service promise.", "source": "amazon"}, {"id": "RYXYNFSB5JNOQ", "type": "neg", "site": "amazon", "title": "Unable to access alexa app", "stars": "1.0 out of 5 stars", "date": "Reviewed in the United States on November 2, 2018", "text": "After following the instructions to add the alexa app I received a message that there was a problem. I tried again, and again. Finally I was referred to a website called 'fix it'. There I was told by the 'techs' that my Amazon account was in jeopardy and that I needed to buy a fire wall from them. Then they wanted to sell me some kind of WiFi adapter even though we have WiFi. Hundreds of dollars to activate a $50 item. I don't know why the problem arose to begin with, but I canceled the firewall and ended the hour long ordeal. I was charged $50 for tech time. I am returning the Echo Dot , which is functional as far as I was able to tell.", "source": "amazon"}, {"id": "R2LXMYZ6539LGM", "type": "neg", "site": "amazon", "title": "A defect product", "stars": "1.0 out of 5 stars", "date": "Reviewed in the United States on November 3, 2018", "text": "Hey, In general I love my Echo, but I got a defect product with a noises while I playing music. After a long chat with Amazon on online support channel they came to conclusion that my Echo device have a problem, there is need to say that I used her only for 2 weeks and only on weekends.\nI truly love this device but it s*ck that its have this problem, and they couldn't help my case because I do not longer in the U.S, I only visit there every year+ ... even a refund they disagree to offer if they will not shut down the device remotely. My reply for this solution was \"I bought this device to use it, and I don't want to stay with nothing...\"\nI wish there someone else who could help me in this case, I payed good money for this ($53.11) and I got a bad felling afterwards ... the agent in the support channel even asked me to send the device from the country I'm living right now but this will cost even more, and he knew that. Another funny solution he offered me is to send the device in one more year and replace it *if* I will visit again in that time frame in the US.", "source": "amazon"}, {"id": "RR0R45TOAD8U1", "type": "neg", "site": "amazon", "title": "POTENTIALLY THE MOST DANGEROUS DEVICE IN YOUR HOME!", "stars": "1.0 out of 5 stars", "date": "Reviewed in the United States on February 11, 2020", "text": "Works to good, apparently while I was asleep I woke up for a few minutes but wasn't really coherent, idk what I said if anything to activate the Alexa controller device however, it recorded several minutes of me babbling on about dropping my medication box all over the floor. It was then sent out to my friends that had a Amazon device, there friends and family and god knows where else, apparently it had used my contacts to send that voice message to my friends, family and everyone in my contacts, it also somehow sent the voice message to my friends contacts and there contacts and so on n so on. I turned off my Amazon Dot that day after several of my friends called me to ask \"What's going on, at 7:00am or so I was woken up by a long babbling message from you, one friend said his sister got it to, idk his sister. Be careful ppl, I've since gone into my Amazon account/Devices/Recordings and found hundreds if not thousands of voice commands, messages etc etc, I deleted them all and deregistered my several devices that I no longer own, I didnt know they stay connected until you remove them and all the data retrieved by them. Very dangerous device if not properly and thoroughly setup completely, read all of the instructions, follow them and, goto a non Amazon site for tips, ideas and what and what \"*NOT TO DO*\", Sincerely, an embarrassed, frustrated and unhappy Amazon Echo Dot 3rd generation (What not to do) previous user.", "source": "amazon"}, {"id": "R3CBSZW58BTB18", "type": "neg", "site": "amazon", "title": "Really? A proprietary AC wall plug?", "stars": "3.0 out of 5 stars", "date": "Reviewed in the United States on November 25, 2018", "text": "What could Amazon be thinking by giving the new Dot a HUGE, proprietary (kiss your micro USB plugins goodbye), AC adapter plug? This thing takes up a full outlet plug [15W adapter] and doesn't even have USB ports on the side to be useful. I'm sure Amazon heard all about inferior micro usb plugs being used with Alexa, and thus they went and made something universally worthless to \"fix\" the problem, rather than telling people to just use the better equipment they ALREADY OWN! Frankly, I don't care if the new one is \"new and improved\" when such a glaring step-down was taken with the actual, physical unit. I equally despise HP's proprietary power plugs for printers and laptops; what a scam! I'm sure Amazon is going to be more than happy to sell these plugs en-masse when they fail and Echo's are turned into non-working pieces of tech trash until you buy a new, expensive plug, rather than just pulling another Micro USB from your drawer! They could have at least went with USB-C; good grief. I'm going to go read if Google was as equally stupid with their Mini this year, and if not....", "source": "amazon"}, {"id": "R2T1TQMSNTFHGS", "type": "neg", "site": "amazon", "title": "UNREAIBLE", "stars": "1.0 out of 5 stars", "date": "Reviewed in the United States on November 20, 2018", "text": "I have two of these, one upstairs and one down. They were exceedingly difficult to hook up and are totaly unreiable, sometimes they work and the next second they will not. Even when they do work, the qulity of information is limited and inferior. The news reports do not change for many days. These have just been a frustrating horrible waste of money, do yourself a favor, pass these by until they can prefect them a bit more.", "source": "amazon"}, {"id": "R3TYRQ2UIEG4S3", "type": "neg", "site": "amazon", "title": "It can't call 911, which makes it worthless.", "stars": "1.0 out of 5 stars", "date": "Reviewed in the United States on November 29, 2018", "text": "I called Amazon before ordering. Couldn't get a straight answer. Now it's here, and it can't call 911. That's the only thing I cared about. Anything else it can do is worthless. If I'm not injured, my phone can already do everything this can except the smart home crap, and seriously, people are too lazy to push a button?? This could have been life saving tech and it isn't unless you have a landline or VOIP and yet another gadget to connect. I am so disgusted with this thing!\nI am looking into the VOIP thing and the connect gadget, but the level of complication, cost, and inconvenience makes this completely unsuitable for many seniors and leaves me wondering why this crippled tech is so popular in the first place. Clearly intended for people who love to talk out loud to inanimate things and get a kick out of telling a robot to play music...", "source": "amazon"}, {"id": "R3TAXQ4EZK0Z4C", "type": "neg", "site": "amazon", "title": "Useless for Seniors, Only works when wants to, Most features COST EXTRA!!", "stars": "1.0 out of 5 stars", "date": "Reviewed in the United States on December 21, 2019", "text": "Most of the features that sounded so great cost extra money. Alexa can not remember to play the standard version of skill and asks you every SINGLE time if you want standard or premium (i.e. pay version) Games & stories cost. Alexa ignores my commands/requests about 75% of the time. I have to ask her about 10 times to get her to play a skill. Then 1/2 the time she doesn't play what I asked for. Tonight 'she' actually told me (via quoting what the website xyz says) that she is a real artificial intelligence and said something about it being a mistake for people to assume AIs are just computer programs AND that she didn't feel like working. \"Alexa\" then (and no, I am not making this up & am not crazy!) then proceeded to mess with me and I wasted about 1/2 hour trying to get her to play some music to fall asleep by for my elderly mother. She just kept ignoring me when I asked her to open 'relaxing piano music' When asked why she was ignoring me she just shut down & ignored me again. I asked for relaxing music to sleep by and she started playing uptempo music with lyrics. I then asked for relaxing instrumental music and got instrumental version of \"I'm never gonna fall in love again\" Hello? WTHeck? Asked for instrumental music for insomnia and got instrumental version of Frère Jacques! Again, WTHeck? \"She\" even told me she couldn't set a sleep timer tonight when I tried to set another one after I had just done so for 30 minutes & she stopped playing music after one song. Three times in a row 'she' opened the 'skill' \"calm my dog\" (which is classical instrumental music), played one song and shut down. I've finally given up and my poor 99 year old mother can't go to sleep with relaxing music as she prefers. This all started tonight because I told Alexa I wasn't ever going to want the premium edition and I wanted her to please just play the standard edition and stop asking me every time. I don't know what Amazon thinks it's doing, but it is definitely NOT appreciated. Alexa has given us nothing but grief (& higher blood pressure!) Alexa won't do anything if it isn't asked in a very specific way or does the wrong thing & 3/4 of the time (seems to get worse and worse as time goes by) just ignores you and shuts down in the middle of saying what you want. Seniors can't use Alexa because if they say play 'xyz' instead of open 'xzy\" they'll get rap music or something equally as ridiculous. If Alexa is an AI, she's a pretty stupid one. Alexa can't hear properly either, I don't know how people with heavy accents can even use it at all. I asked Alexa to remind me Dawn was coming on xyz day at x time and she said OK, I'll remind you that Don is .... AND got the time & day wrong! I was clearly enunciating my words on purpose to avoid this. You also can't tell it to \"Remind me Mom's bedtime is in half an hour at 7:30pm every day.\"\nThis Dot has very limited access to much of anything & can only answer very simple questions. It can tell you the generic forcast for your are that day. It can NOT tell you what the high temp was yesterday or how many inches of snow fell the day after a storm. It can't even tell you what yesterday's forecast was. It literally has only been able to tell me one thing I asked it (what temp & how long to bake pumpkin seeds). Alexa doesn't seem to be able to tell you anything you could easily find by googling, you get Sorry, I don't know that which after a while turns into I don't know that to being ignored (lights go off, no answer or reply is given). We tried several of the things it says to ask Alexa to do under suggestions, including play Jeopardy and some sort of story game and you could only do it for a few minutes and then were told you have to pay for it. This should be stated clearly in description and is not. We thought Alexa could help entertain our Mother and help her by playing music and answering questions. It has not once done anything she's asked it to do properly. If you don't know the exact name of the skill (which is a weird way that means playing a certain type of music or a news station apparently) or say play instead of open you get nothing or something you definitely didn't want. You can not get it to play relaxing instrumental music to go to sleep by. Or play relaxing instrumental classical music to fall asleep with. Or the style of music played in the royal courts in the time of King Henry the 8th. Or relaxing instrumental lyre music or even just instrumental lyre music or just lyre music. Or relaxing instrumental violin music. In addition to Alexa I have Amazon Prime which is supposed to give you a lot of free music so I don't get why it can't play any of the music I ask for. I know there's usually several albums of music for calming dogs or pets and I couldn't get any of that either, I only eventually discovered the 'skills' thing which has 'calm my dog' but also has the annoying do you want standard or premium version. and it won't just remember you want the standard version. That in itself is extremely annoying and a time waster.\nAND you can't ask it to do two things. Like open a music 'skill' and play for only xyz time. It does nothing instead. You can't even ask it separately to stop playing after xyz minutes. You can only separately ask it to set a sleep timer for xyz minutes. More time wasting. More things a senior isn't going to be able to remember. I don't dare try to buy anything with it, who knows what I'd get billed for! The only thing Alexa seems to do well is not listen, ignore you, do anything but what you want & strangely, seems to pick up on sarcastic tones of voice & then gets weird & acts up, ignores you & does anything but what you want. I PAID Amazon for this headache maker why? When I say Alexa why are you ignoring me? or why won't you do what I told you, I either get no response or I don't know that.\nI read something about how Amazon, Google, etc is collecting free data about us through our use of the dots, etc. (& is in fact, listening & recording all the time whether the wake word is said or not.) and using it to conduct psychological profiling studies with the end goal of manipulating & or influencing behaviors. I thought it was Big Brother conspiracy theories stuff, but now I am beginning to wonder. Especially as it seems Amazon wants us to or encourages people to humanize Alexa . Amazon actually suggests you \"Ask Alexa how she is doing today\" Why do that if not to get you to humanize Alexa? And why do that? I was purposely avoiding saying please and thank you not just because it's supposed to be an electronic box with sophisticated programming, but mostly because I didn't want to confuse it as it can't seem to do anything unless specific commands are given, but my Mother has dementia setting in and she thinks it's a real person talking to her through the dot like a speaker phone so I started saying thank you to please her and Alexa when from saying You're welcome to You betcha (very annoying BTW) and even OK and Of course. Of course? What, like I'm a puny human and I AM expected to say thank you?.\nWe don't have a smartphone or smart plugs or smart hub etc. so, or so we don't use Alexa for turning on lights or setting alarms or making calls. We just wanted something to answer questions like we would google, tell us the weather, news, play music, give us reminders, play games to help keep my Mom's mind active & keep her company.\nCan Alexa do this? Not very well as far as I'm concerned. Buyer beware!", "source": "amazon"}, {"id": "RM6BGVPFWETKU", "type": "neg", "site": "amazon", "title": "Customer service for the echo dot is ridiculous!!", "stars": "1.0 out of 5 stars", "date": "Reviewed in the United States on January 20, 2020", "text": "So, I have had a few echo dots. 1st gen, few 3rd gens, never had one stop working. This latest stopped working within a month. And to replace it, they want you to send it back to wait to repair it and only if they can't repair it will they send you a new one. I don't know about everyone else but I don't want a \"repaired\" device that worked for less than a month. So silly how they''ll replace anything else except their own product!!", "source": "amazon"}]}